{
  "backend/main.mo": "Defines user wellness data types and includes authorization and blob storage mixins, providing queries like admin-restricted user retrieval.",
  "feature_evidence.json": "Feature evidence report describing a change to restore text-based branding on the landing page header.",
  "frontend-file-summaries.txt": "Aggregated summaries of multiple frontend files describing their roles in authentication, onboarding, dashboard pages, and management components.",
  "frontend/index.css": "Tailwind-based global styling with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling auth flow, onboarding, profile setup, and dashboard routing with a welcome tutorial.",
  "frontend/src/components/DebtManagement.tsx": "UI component for adding, editing, deleting debts and logging payments with progress tracking and charts.",
  "frontend/src/components/MedicationManagement.tsx": "UI component for medication CRUD operations and adherence logging with dialog-driven interactions.",
  "frontend/src/components/WelcomeTutorial.tsx": "A modal tutorial component introducing SHAMMAH’s features and wellness pillars with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity persistence through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profile, onboarding, photos, and other backend interactions with mutation helpers.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables and theming for light and dark modes with wellness-focused palette.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard layout with sidebar navigation and dynamic rendering of wellness pages based on selected section.",
  "frontend/src/pages/dashboard/JournalPage.tsx": "Journal interface showing entries and a dialog to add new ones using addJournalEntry.",
  "frontend/src/pages/dashboard/MindfulnessPage.tsx": "Mindfulness tracking page listing activities and a dialog to log new meditation or mindfulness sessions.",
  "frontend/src/pages/dashboard/OverviewPage.tsx": "Dashboard overview showing wellness progress, pillar breakdown, and recent journal and mindfulness activity.",
  "frontend/src/pages/dashboard/PillarPage.tsx": "Renders a wellness pillar page with activity logging, reflection input, trackers, and condition-based components like medication and habit monitoring.",
  "frontend/src/pages/dashboard/QuizPage.tsx": "Implements a multi-step quiz that saves responses and displays a completion summary once all questions are answered.",
  "frontend/src/pages/dashboard/ResourcesPage.tsx": "Displays categorized wellness resources including videos, ebooks, and guides using mock data.",
  "frontend/src/pages/dashboard/RewardsPage.tsx": "Shows user rewards, points, and earned or in-progress badges with visual progress sections.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with branding, hero content, and Internet Identity sign‑in flow, including login card and disabled Google option.",
  "frontend/src/pages/OnboardingFlow.tsx": "Guided onboarding flow handling baseline photo upload and multi‑question wellness quiz with backend mutations.",
  "frontend/src/pages/ProfileSetup.tsx": "User profile setup form allowing email and display name submission via createProfile mutation.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, plugins, animations, and container settings.",
  "project_state.json": "Describes the project’s current state, including branding rollback issues, architectural notes, known build problems, and lists existing and new feature requests. Primarily tracks header-image revert needs and pending wellness app enhancements."
}