{
  "backend/main.mo": "Defines the backend canister with user profiles, wellness data types, storage mixins, and admin‑restricted queries for retrieving user information.",
  "feature_evidence.json": "Contains feature evidence records describing landing page branding updates and asset usage with metadata for tests and components.",
  "frontend-file-summaries.txt": "Provides short summaries of key frontend files including pages, components, and assets used across the React app.",
  "frontend/index.css": "Tailwind CSS setup defining global OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Base HTML template setting page metadata and loading the React application entrypoint.",
  "frontend/src/App.tsx": "Main React component controlling authentication, onboarding, routing, and the display of the welcome tutorial.",
  "frontend/src/components/DebtManagement.tsx": "UI component for adding, editing, deleting, and tracking debt records with payment history and progress visualization.",
  "frontend/src/components/MedicationManagement.tsx": "UI component for managing medications, including CRUD operations and adherence logging with notes.",
  "frontend/src/components/WelcomeTutorial.tsx": "A modal tutorial component introducing SHAMMAH with feature highlights and branding.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profile, onboarding, photos, and other backend interactions using the actor.",
  "frontend/src/index.css": "Tailwind base theme defining wellness‑themed colors, dark mode variables, global styles, and custom scrollbars.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard UI with sidebar navigation that switches between wellness pages and handles logout via Internet Identity.",
  "frontend/src/pages/dashboard/JournalPage.tsx": "Journal interface allowing users to create entries via a dialog and view existing entries from their profile.",
  "frontend/src/pages/dashboard/MindfulnessPage.tsx": "Mindfulness activity logger where users record activity type and duration and view accumulated minutes.",
  "frontend/src/pages/dashboard/OverviewPage.tsx": "Dashboard overview summarizing overall wellness progress, pillar progress, and recent journal and mindfulness activity.",
  "frontend/src/pages/dashboard/PillarPage.tsx": "Renders detailed content for a selected wellness pillar, including trackers, activity logging, and reward handling using user profile data.",
  "frontend/src/pages/dashboard/QuizPage.tsx": "Implements a multi‑step wellness quiz, saving answers and showing a completion summary once all questions are answered.",
  "frontend/src/pages/dashboard/ResourcesPage.tsx": "Displays categorized wellness resources such as videos, ebooks, and guides using static mock data.",
  "frontend/src/pages/dashboard/RewardsPage.tsx": "Shows user points, badges, and earned rewards, separating achieved and in‑progress items.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with branding, hero content, and sign‑in actions using Internet Identity and placeholder OAuth options.",
  "frontend/src/pages/OnboardingFlow.tsx": "Two‑step onboarding that uploads a baseline photo and collects quiz responses before marking onboarding complete.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation form that submits a new user’s email and display name.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Project state describing current wellness app features, branding updates, architectural notes, known issues, and a list of existing and pending feature requests."
}