{
  "backend/main.mo": "Defines the backend canister with user profiles, wellness data types, resources, debts, medications, and admin‑gated query methods using access control and storage mixins.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten 1–2 sentence summaries for many frontend files including pages, hooks, components, and assets.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, onboarding flow, dashboard routing, and tutorial display logic.",
  "frontend/src/components/DebtManagement.tsx": "UI component for managing debts including add/edit/delete, payment logging, progress tracking, and balance charting.",
  "frontend/src/components/MedicationManagement.tsx": "UI component for listing medications and handling add, edit, delete, and adherence logging via query hooks.",
  "frontend/src/components/WelcomeTutorial.tsx": "Introductory dialog explaining SHAMMAH features with icons and descriptions, shown on initial user onboarding.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, onboarding, photos, medications, debts, and other backend interactions with toast notifications.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for theming, dark mode, and scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and mounts the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard container with sidebar navigation, page routing, and logout handling.",
  "frontend/src/pages/dashboard/JournalPage.tsx": "Journal interface to view past entries and add new reflections via a dialog.",
  "frontend/src/pages/dashboard/MindfulnessPage.tsx": "Mindfulness tracker for logging activities and viewing total minutes practiced.",
  "frontend/src/pages/dashboard/OverviewPage.tsx": "Renders a user wellness overview with overall progress, pillar breakdowns, and recent journal/mindfulness activity using fetched user profile data.",
  "frontend/src/pages/dashboard/PillarPage.tsx": "Displays detailed content for a specific wellness pillar, including trackers, monitoring toggles, and activity logging tied to reward updates.",
  "frontend/src/pages/dashboard/QuizPage.tsx": "Implements a multi-step wellness quiz, saving responses per question and showing a completion summary when all questions are answered.",
  "frontend/src/pages/dashboard/ResourcesPage.tsx": "Shows categorized wellness resources including videos, ebooks, and guides, using static mock data.",
  "frontend/src/pages/dashboard/RewardsPage.tsx": "Displays user points, badges, and earned rewards, separating achieved and in-progress badges based on user profile data.",
  "frontend/src/pages/LandingPage.tsx": "Public landing screen with hero section and Internet Identity sign‑in flow.",
  "frontend/src/pages/OnboardingFlow.tsx": "Guided onboarding capturing a baseline photo and multi‑step wellness quiz.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation form allowing users to set email and display name.",
  "frontend/src/utils/buildMarker.ts": "Generates a build marker string from environment variables or a timestamp fallback for development.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and container settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing current state, known deployment issues, and existing features related to branding, build markers, and cache busting."
}