{
  "kind": "build_request",
  "title": "Revert landing page header branding to previous (remove broken Butterfly image)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Revert the landing page header branding in `frontend/src/pages/LandingPage.tsx` to what it was before the Butterfly Wellness wordmark change, since the header image is not displaying. Specifically, remove the header `<img>` that references `/assets/branding/butterfly-wellness-wordmark.png` and restore the previous SHAMMAH header branding (text-based, not dependent on the missing image), while keeping the existing header layout (left branding, right Sign In button).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The image is not showing so just replace it with what was previously there"
        ]
      },
      "acceptanceCriteria": [
        "On the Landing page, the header no longer attempts to load `/assets/branding/butterfly-wellness-wordmark.png`.",
        "The header branding renders reliably (no broken image icon) and matches the previous SHAMMAH branding style (text-based).",
        "The Sign In button remains visible and functional, with no layout regression in the header."
      ]
    }
  ],
  "constraints": [
    "Frontend files under `frontend/src/components/ui` must not be edited; compose them only.",
    "Do not modify any files listed as immutable in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Backend is single-actor Motoko; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not implement any of the pending new feature requests in `project_state.json` (trackers, finance, body map, etc.).",
    "Do not add new authentication providers (Google/Microsoft remain 'Coming Soon').",
    "Do not redesign the landing page beyond reverting the header branding change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}